formulaslug/fs-4-firmware/custom_targets/STEERING_WHEEL_BOARD_G47/PeripheralPins.c
/* mbed Microcontroller Library
 * SPDX-License-Identifier: BSD-3-Clause
 ******************************************************************************
 *
 * Copyright (c) 2016-2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 *
 * Automatically generated from STM32CubeMX/db/mcu/STM32G473R(B-C-E)Tx.xml
 */

#include "PeripheralPins.h"
#include "mbed_toolchain.h"

//==============================================================================
// Notes
//
// - The pins mentioned Px_y_ALTz are alternative possibilities which use other
//   HW peripheral instances. You can use them the same way as any other "normal"
//   pin (i.e. PwmOut pwm(PA_7_ALT0);). These pins are not displayed on the board
//   pinout image on mbed.org.
//
// - The pins which are connected to other components present on the board have
//   the comment "Connected to xxx". The pin function may not work properly in this
//   case. These pins may not be displayed on the board pinout image on mbed.org.
//   Please read the board reference manual and schematic for more information.
//
// - Warning: pins connected to the default STDIO_UART_TX and STDIO_UART_RX pins are commented
//   See https://os.mbed.com/teams/ST/wiki/STDIO for more information.
//
//==============================================================================


//*** GPIO ***

MBED_WEAK const PinMap PinMap_GPIO[] = {
    {PA_0,  0, GPIO_NOPULL},
    {PA_1,  0, GPIO_NOPULL},
    {PA_2,  0, GPIO_NOPULL}, // Connected to QUADSPI1_BK1_NCS
    {PA_3,  0, GPIO_NOPULL}, // Connected to QUADSPI1_CLK
    {PA_4,  0, GPIO_NOPULL},
    {PA_5,  0, GPIO_NOPULL},
    {PA_6,  0, GPIO_NOPULL}, // Connected to QUADSPI1_BK1_IO3
    {PA_7,  0, GPIO_NOPULL}, // Connected to QUADSPI1_BK1_IO2
    {PA_8,  0, GPIO_NOPULL},
    {PA_9,  0, GPIO_NOPULL},
    {PA_10, 0, GPIO_NOPULL},
    {PA_11, 0, GPIO_NOPULL}, // Connected to FDCAN1_RX
    {PA_12, 0, GPIO_NOPULL}, // Connected to FDCAN1_TX
    {PA_13, 0, GPIO_NOPULL}, // Connected to SYS_JTMS-SWDIO
    {PA_14, 0, GPIO_NOPULL}, // Connected to SYS_JTCK-SWCLK
    {PA_15, 0, GPIO_NOPULL},
    {PB_0,  0, GPIO_NOPULL}, // Connected to QUADSPI1_BK1_IO1
    {PB_1,  0, GPIO_NOPULL}, // Connected to QUADSPI1_BK1_IO0
    {PB_2,  0, GPIO_NOPULL},
    {PB_3,  0, GPIO_NOPULL}, // Connected to SYS_JTDO-SWO
    {PB_4,  0, GPIO_NOPULL},
    {PB_5,  0, GPIO_NOPULL},
    {PB_6,  0, GPIO_NOPULL}, // Connected to USART1_TX
    {PB_7,  0, GPIO_NOPULL}, // Connected to USART1_RX
    {PB_8,  0, GPIO_NOPULL}, // PB8-BOOT0
    {PB_9,  0, GPIO_NOPULL},
    {PB_10, 0, GPIO_NOPULL},
    {PB_11, 0, GPIO_NOPULL},
    {PB_12, 0, GPIO_NOPULL},
    {PB_13, 0, GPIO_NOPULL},
    {PB_14, 0, GPIO_NOPULL},
    {PB_15, 0, GPIO_NOPULL},
    {PC_0,  0, GPIO_NOPULL},
    {PC_1,  0, GPIO_NOPULL},
    {PC_2,  0, GPIO_NOPULL},
    {PC_3,  0, GPIO_NOPULL},
    {PC_4,  0, GPIO_NOPULL},
    {PC_5,  0, GPIO_NOPULL},
    {PC_6,  0, GPIO_NOPULL},
    {PC_7,  0, GPIO_NOPULL},
    {PC_8,  0, GPIO_NOPULL},
    {PC_9,  0, GPIO_NOPULL},
    {PC_10, 0, GPIO_NOPULL},
    {PC_11, 0, GPIO_NOPULL},
    {PC_12, 0, GPIO_NOPULL},
    {PC_13, 0, GPIO_NOPULL},
//  {PC_14, 0, GPIO_NOPULL}, // PC14-OSC32_IN
//  {PC_15, 0, GPIO_NOPULL}, // PC15-OSC32_OUT
    {PD_2,  0, GPIO_NOPULL},
//  {PF_0,  0, GPIO_NOPULL}, // Connected to RCC_OSC_IN // PF0-OSC_IN
//  {PF_1,  0, GPIO_NOPULL}, // Connected to RCC_OSC_OUT // PF1-OSC_OUT
    {PG_10, 0, GPIO_NOPULL}, // PG10-NRST
    {NC, NC, 0}
};

//*** ADC ***

MBED_WEAK const PinMap PinMap_ADC[] = {
    {PA_0,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // ADC1_IN1
    {PA_0_ALT0,  ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // ADC2_IN1
    {PA_1,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 2, 0)}, // ADC1_IN2
    {PA_1_ALT0,  ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 2, 0)}, // ADC2_IN2
    {PA_2,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 3, 0)}, // ADC1_IN3 // Connected to QUADSPI1_BK1_NCS
    {PA_3,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 4, 0)}, // ADC1_IN4 // Connected to QUADSPI1_CLK
    {PA_4,       ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 17, 0)}, // ADC2_IN17
    {PA_5,       ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 13, 0)}, // ADC2_IN13
    {PA_6,       ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 3, 0)}, // ADC2_IN3 // Connected to QUADSPI1_BK1_IO3
    {PA_7,       ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 4, 0)}, // ADC2_IN4 // Connected to QUADSPI1_BK1_IO2
    {PA_8,       ADC_5, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // ADC5_IN1
    {PA_9,       ADC_5, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 2, 0)}, // ADC5_IN2
    {PB_0,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 15, 0)}, // ADC1_IN15 // Connected to QUADSPI1_BK1_IO1
    {PB_0_ALT0,  ADC_3, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 12, 0)}, // ADC3_IN12 // Connected to QUADSPI1_BK1_IO1
    {PB_1,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 12, 0)}, // ADC1_IN12 // Connected to QUADSPI1_BK1_IO0
    {PB_1_ALT0,  ADC_3, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 1, 0)}, // ADC3_IN1 // Connected to QUADSPI1_BK1_IO0
    {PB_2,       ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 12, 0)}, // ADC2_IN12
    {PB_11,      ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 14, 0)}, // ADC1_IN14
    {PB_11_ALT0, ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 14, 0)}, // ADC2_IN14
    {PB_12,      ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 11, 0)}, // ADC1_IN11
    {PB_12_ALT0, ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 3, 0)}, // ADC4_IN3
    {PB_13,      ADC_3, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)}, // ADC3_IN5
    {PB_14,      ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)}, // ADC1_IN5
    {PB_14_ALT0, ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 4, 0)}, // ADC4_IN4
    {PB_15,      ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 15, 0)}, // ADC2_IN15
    {PB_15_ALT0, ADC_4, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)}, // ADC4_IN5
    {PC_0,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 6, 0)}, // ADC1_IN6
    {PC_0_ALT0,  ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 6, 0)}, // ADC2_IN6
    {PC_1,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 7, 0)}, // ADC1_IN7
    {PC_1_ALT0,  ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 7, 0)}, // ADC2_IN7
    {PC_2,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 8, 0)}, // ADC1_IN8
    {PC_2_ALT0,  ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 8, 0)}, // ADC2_IN8
    {PC_3,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 9, 0)}, // ADC1_IN9
    {PC_3_ALT0,  ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 9, 0)}, // ADC2_IN9
    {PC_4,       ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 5, 0)}, // ADC2_IN5
    {PC_5,       ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 11, 0)}, // ADC2_IN11
//  {PF_0,       ADC_1, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 10, 0)}, // ADC1_IN10 // Connected to RCC_OSC_IN
//  {PF_1,       ADC_2, STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 10, 0)}, // ADC2_IN10 // Connected to RCC_OSC_OUT
    {NC, NC, 0}
};

